---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.ClearCutLayerModifiers
source: html/76f91359-1f5d-1d3b-e934-bf6a74a08d06.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.ClearCutLayerModifiers Method

Clears all the cut layer modifiers stored in the layer info.

## Syntax (C#)
```csharp
public void ClearCutLayerModifiers()
```